---
kind: method
id: M:Autodesk.Revit.DB.InternalDefinition.GetTypeId
source: html/6d1004ae-5755-d3a6-f8ca-7e577ae486df.htm
---
# Autodesk.Revit.DB.InternalDefinition.GetTypeId Method

Gets the identifier of the parameter.

## Syntax (C#)
```csharp
public ForgeTypeId GetTypeId()
```